<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>ROT18 के बारे में</h3>
<p>ROT18 एक मोनोअल्फाबेटिक सब्सटीट्यूशन सिफर (monoalphabetic substitution cipher) है जो टेक्स्ट में वर्णों को अन्य वर्णों से बदलकर एन्क्रिप्ट करता है।</p>
<p>वर्णों का प्रतिस्थापन "A" से "Z" तक के वर्णों को "ABCDEFGHIJKLMNOPQRSTUVWXYZ" के 26 वर्णों के भीतर 13 वर्ण शिफ्ट करके किया जाता है। इसके अलावा, संख्याओं "0" से "9" को "0123456789" के 10 वर्णों के भीतर 5 वर्ण शिफ्ट किया जाता है।</p>
<p>उदाहरण के लिए, "A" को "N" और "0" को "5" में एन्क्रिप्ट किया जाता है।</p>

<pre>
एन्क्रिप्शन से पहले : ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789
एन्क्रिप्शन के बाद : NOPQRSTUVWXYZABCDEFGHIJKLM5678901234
</pre>

<pre>
एन्क्रिप्शन से पहले का टेक्स्ट : THIS IS A SECRET MESSAGE 123
एन्क्रिप्शन के बाद का टेक्स्ट : GUVF VF N FRPERG ZRFFNTR 567
</pre>

<p>चूंकि इसमें उलटनीयता (reversibility) है कि सिफरटेक्स्ट को फिर से एन्क्रिप्ट करने पर प्लेनटेक्स्ट (plaintext) प्राप्त होता है, इसलिए डिक्रिप्शन भी एन्क्रिप्शन की तरह ही किया जा सकता है।</p>
