<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>Rail Fence Cipher के बारे में</h3>
<p>Rail Fence Cipher एक ट्रांस्पोज़िशन सिफर (transposition cipher) है जो टेक्स्ट में वर्णों को पुनर्व्यवस्थित करके एन्क्रिप्ट करता है।</p>
<p>Rail Fence का अर्थ है रेल (crossbar) से बनी बाड़। इसमें वर्णों को रेल पर ज़िगज़ैग पैटर्न में रखकर और अंत में रेल की इकाइयों में वर्णों को जोड़कर एन्क्रिप्ट किया जाता है।</p>
<p>रेलों की संख्या एन्क्रिप्शन की कुंजी (key) होती है।</p>

<p>उदाहरण के लिए, यदि हम "THIS_IS_A_SECRET_MESSAGE" को 4 रेलों के साथ एन्क्रिप्ट करते हैं, तो यह इस प्रकार होगा।</p>

<p>1. 4 रेल तैयार करें (ऊंचाई 4), और वर्णों को ऊपर बाईं ओर से ज़िगज़ैग पैटर्न में रखें।</p>
<pre>
-----------------------------------------------
T           S           C           E          
-----------------------------------------------
  H       I   _       E   R       M   S       E
-----------------------------------------------
    I   _       A   S       E   _       S   G  
-----------------------------------------------
      S           _           T           A    
-----------------------------------------------
</pre>

<p>2. रखे गए वर्णों को रेल के अनुसार प्राप्त करें।</p>
<pre>
TSCE
HI_ERMSE
I_ASE_SG
S_TA
</pre>

<p>3. रेल के वर्णों को जोड़ें।</p>
<pre>TSCEHI_ERMSEI_ASE_SGS_TA</pre>
