<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>Base32 के बारे में</h3>
<p>Base32, प्रिंट करने योग्य ASCII वर्णों का उपयोग करने वाली एक एन्कोडिंग योजना है।</p>
<p>Base32 में, डेटा को 5 बिट्स में विभाजित किया जाता है और उन्हें अल्फ़ान्यूमेरिक (A-Z, 2-7) वर्णों में बदल दिया जाता है। 8 वर्णों के समूह में परिवर्तित किया जाता है, और यदि अंत में 8 वर्ण नहीं हैं, तो अंत में बराबर चिह्न (=) से पैडिंग की जाती है।</p>

<p>Base32 वर्ण रूपांतरण तालिका निम्नानुसार है।</p>

<div class="table-responsive">
	<table class="table">
		<tr><th>5-बिट डेटा</th><th>Base32 वर्ण</th></tr>
		<tr><td>00000</td><td>A</td></tr>
		<tr><td>00001</td><td>B</td></tr>
		<tr><td>00010</td><td>C</td></tr>
		<tr><td>00011</td><td>D</td></tr>
		<tr><td>00100</td><td>E</td></tr>
		<tr><td>00101</td><td>F</td></tr>
		<tr><td>00110</td><td>G</td></tr>
		<tr><td>00111</td><td>H</td></tr>
		<tr><td>01000</td><td>I</td></tr>
		<tr><td>01001</td><td>J</td></tr>
		<tr><td>01010</td><td>K</td></tr>
		<tr><td>01011</td><td>L</td></tr>
		<tr><td>01100</td><td>M</td></tr>
		<tr><td>01101</td><td>N</td></tr>
		<tr><td>01110</td><td>O</td></tr>
		<tr><td>01111</td><td>P</td></tr>
		<tr><td>10000</td><td>Q</td></tr>
		<tr><td>10001</td><td>R</td></tr>
		<tr><td>10010</td><td>S</td></tr>
		<tr><td>10011</td><td>T</td></tr>
		<tr><td>10100</td><td>U</td></tr>
		<tr><td>10101</td><td>V</td></tr>
		<tr><td>10110</td><td>W</td></tr>
		<tr><td>10111</td><td>X</td></tr>
		<tr><td>11000</td><td>Y</td></tr>
		<tr><td>11001</td><td>Z</td></tr>
		<tr><td>11010</td><td>2</td></tr>
		<tr><td>11011</td><td>3</td></tr>
		<tr><td>11100</td><td>4</td></tr>
		<tr><td>11101</td><td>5</td></tr>
		<tr><td>11110</td><td>6</td></tr>
		<tr><td>11111</td><td>7</td></tr>
	</table>
</div>

<p>उदाहरण के लिए, "Hello!" को Base32 में बदलने पर परिणाम इस प्रकार होगा।</p>

<p>1. बाइनरी प्रतिनिधित्व में बदलें।</p>

<pre>01001000 01100101 01101100 01101100 01101111 00100001  (US-ASCII / UTF-8 के मामले में)</pre>

<p>2. हर 5 बिट में विभाजित करें। यदि 5 बिट से कम हैं, तो अंत में "0" से पैडिंग करें।</p>

<pre>01001 00001 10010 10110 11000 11011 00011 01111 00100 00100</pre>

<p>3. रूपांतरण तालिका का उपयोग करके वर्णों में बदलें। 8 वर्णों के समूह में बदलें, और यदि 8 वर्णों से कम हैं, तो अंत में "=" से पैडिंग करें।</p>

<pre>JBSWY3DP EE======</pre>

<p>4. सभी वर्णों को जोड़कर Base32 का रूपांतरण परिणाम प्राप्त करें।</p>

<pre>JBSWY3DPEE======</pre>
