<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>ब्रेल के बारे में</h3>
<p>
ब्रेल एक स्पर्शनीय लेखन प्रणाली है जिसमें उभरे हुए बिंदु होते हैं, जिन्हें दृष्टिबाधित और अंधे लोगों द्वारा उंगलियों से पढ़ने के लिए डिज़ाइन किया गया है।
यह 3 पंक्तियों और 2 स्तंभों में व्यवस्थित 6 बिंदुओं के संयोजन के माध्यम से किसी वर्ण या प्रतीक को दर्शाता है (6-बिंदु ब्रेल)।
इस प्रणाली का उपयोग विश्व स्तर पर किया जाता है, और भाषा के आधार पर बिंदु असाइनमेंट के नियम भिन्न होते हैं।
</p>


<h3>अंग्रेजी ब्रेल (यूईबी ग्रेड 1)</h3>
<p>
यह टूल अंग्रेजी भाषी दुनिया में मानक के रूप में उपयोग किए जाने वाले "यूनिफाइड इंग्लिश ब्रेल (UEB)" ग्रेड 1 (अनसंकुचित अंग्रेजी ब्रेल: एक विधि जो वर्णमाला के प्रत्येक अक्षर की वर्तनी लिखती है) के आधार पर रूपांतरण करता है। संकुचित रूप (ग्रेड 2) समर्थित नहीं हैं।
</p>

<p>रूपांतरण का उदाहरण:</p>
<pre>
"Hello, world!"
⠦⠠⠓⠑⠇⠇⠕⠂⠀⠺⠕⠗⠇⠙⠖⠴
</pre>

<h4>वर्णमाला</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>a</th><td>⠁</td><th>b</th><td>⠃</td><th>c</th><td>⠉</td><th>d</th><td>⠙</td><th>e</th><td>⠑</td></tr>
		<tr><th>f</th><td>⠋</td><th>g</th><td>⠛</td><th>h</th><td>⠓</td><th>i</th><td>⠊</td><th>j</th><td>⠚</td></tr>
		<tr><th>k</th><td>⠅</td><th>l</th><td>⠇</td><th>m</th><td>⠍</td><th>n</th><td>⠝</td><th>o</th><td>⠕</td></tr>
		<tr><th>p</th><td>⠏</td><th>q</th><td>⠟</td><th>r</th><td>⠗</td><th>s</th><td>⠎</td><th>t</th><td>⠞</td></tr>
		<tr><th>u</th><td>⠥</td><th>v</th><td>⠧</td><th>w</th><td>⠺</td><th>x</th><td>⠭</td><th>y</th><td>⠽</td></tr>
		<tr><th>z</th><td>⠵</td><th></th><td></td><th></th><td></td><th></th><td></td><th></th><td></td></tr>
	</table>
</div>
<p>
बड़े अक्षरों के लिए, अक्षर से पहले एक कैपिटल इंडिकेटर (<code>⠠</code>) रखा जाता है।
इसके अतिरिक्त, लगातार बड़े अक्षरों के मामले में, "कैपिटल वर्ड इंडिकेटर (<code>⠠⠠</code>)" एक ही शब्द को कैपिटलाइज़ करता है; कई शब्दों के लिए "कैपिटल पैसेज इंडिकेटर (<code>⠠⠠⠠</code>)" का इस्तेमाल होता है; और इसे लागू करने के अंत में "कैपिटल टर्मिनेटर (<code>⠠⠄</code>)" का उपयोग किया जाता है।
</p>

<h4>संख्याएं</h4>
<p>
संख्याओं को उनके पहले संख्या के चिह्न (<code>⠼</code>) लगाकर दर्शाया जाता है। उसके बाद आने वाले वर्णों को अंकों के रूप में माना जाएगा, जो 'a' से 'j' अक्षरों के ब्रेल को उधार लेते हैं।
</p>
<div class="table-responsive">
	<table class="table">
		<tr><th>संख्यात्मक चिह्न</th><td>⠼</td></tr>
	</table>
</div>
<div class="table-responsive">
	<table class="table">
		<tr><th>1</th><td>⠁</td><th>2</th><td>⠃</td><th>3</th><td>⠉</td><th>4</th><td>⠙</td><th>5</th><td>⠑</td></tr>
		<tr><th>6</th><td>⠋</td><th>7</th><td>⠛</td><th>8</th><td>⠓</td><th>9</th><td>⠊</td><th>0</th><td>⠚</td></tr>
	</table>
</div>
<p>
यदि संख्या के ठीक बाद छोटे अक्षर a-j आते हैं, तो अंकों के साथ उनके भ्रम से बचने के लिए, एक ग्रेड 1 इंडिकेटर (<code>⠰</code>) डाला जाता है।
</p>

<h4>मुख्य प्रतीक</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>, (कॉमा)</th><td>⠂</td><th>. (पूर्ण विराम)</th><td>⠲</td><th>! (विस्मयादिबोधक)</th><td>⠖</td><th>? (प्रश्नवाचक)</th><td>⠦</td></tr>
		<tr><th>' (एपॉस्ट्रॉफी)</th><td>⠄</td><th>- (हाइफ़न)</th><td>⠤</td><th>; (अर्धविराम)</th><td>⠆</td><th>: (कोलन)</th><td>⠒</td></tr>
	</table>
</div>

<h4>उद्धरण और कोष्ठक</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>" *** " (गैर-दिशात्मक दोहरा)</th><td>⠦ *** ⠴</td><th>' *** ' (गैर-दिशात्मक एकल)</th><td>⠠⠦ *** ⠠⠴</td></tr>
		<tr><th>“ *** ” (दिशात्मक दोहरा)</th><td>⠘⠦ *** ⠘⠴</td><th>‘ *** ’ (दिशात्मक एकल)</th><td>⠠⠘⠦ *** ⠠⠘⠴</td></tr>
		<tr><th>« *** » (शेवरॉन / गिलमेट)</th><td>⠨⠦ *** ⠨⠴</td><th>&lt; *** &gt; (कोण कोष्ठक)</th><td>⠈⠣ *** ⠈⠜</td></tr>
		<tr><th>( *** ) (गोल कोष्ठक)</th><td>⠐⠣ *** ⠐⠜</td><th>[ *** ] (वर्गाकार कोष्ठक)</th><td>⠨⠣ *** ⠨⠜</td></tr>
		<tr><th>{ *** } (मंझले कोष्ठक)</th><td>⠸⠣ *** ⠸⠜</td><th></th><td></td></tr>
	</table>
</div>


<h3>जापानी ब्रेल</h3>
<p>
जापानी ब्रेल वाक्यों को पहले काना (जापानी शब्दांश) में अनुवादित करके और फिर उन्हें ब्रेल में परिवर्तित करके दर्शाया जाता है।
</p>

<p>रूपांतरण का उदाहरण:</p>
<pre>
"コンニチワ、セカイ！"
⠤⠪⠴⠇⠗⠄⠰⠀⠻⠡⠃⠖⠤
</pre>

<h4>काना</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>ア (a)</th><td>⠁</td><th>イ (i)</th><td>⠃</td><th>ウ (u)</th><td>⠉</td><th>エ (e)</th><td>⠋</td><th>オ (o)</th><td>⠊</td></tr>
		<tr><th>カ (ka)</th><td>⠡</td><th>キ (ki)</th><td>⠣</td><th>ク (ku)</th><td>⠩</td><th>ケ (ke)</th><td>⠫</td><th>コ (ko)</th><td>⠪</td></tr>
		<tr><th>サ (sa)</th><td>⠱</td><th>シ (shi)</th><td>⠳</td><th>ス (su)</th><td>⠹</td><th>セ (se)</th><td>⠻</td><th>ソ (so)</th><td>⠺</td></tr>
		<tr><th>タ (ta)</th><td>⠕</td><th>チ (chi)</th><td>⠗</td><th>ツ (tsu)</th><td>⠝</td><th>テ (te)</th><td>⠟</td><th>ト (to)</th><td>⠞</td></tr>
		<tr><th>ナ (na)</th><td>⠅</td><th>ニ (ni)</th><td>⠇</td><th>ヌ (nu)</th><td>⠍</td><th>ネ (ne)</th><td>⠏</td><th>ノ (no)</th><td>⠎</td></tr>
		<tr><th>ハ (ha)</th><td>⠥</td><th>ヒ (hi)</th><td>⠧</td><th>フ (fu)</th><td>⠭</td><th>ヘ (he)</th><td>⠯</td><th>ホ (ho)</th><td>⠮</td></tr>
		<tr><th>マ (ma)</th><td>⠵</td><th>ミ (mi)</th><td>⠷</td><th>ム (mu)</th><td>⠽</td><th>メ (me)</th><td>⠿</td><th>モ (mo)</th><td>⠾</td></tr>
		<tr><th>ヤ (ya)</th><td>⠌</td><th></th><td></td><th>ユ (yu)</th><td>⠬</td><th></th><td></td><th>ヨ (yo)</th><td>⠜</td></tr>
		<tr><th>ラ (ra)</th><td>⠑</td><th>リ (ri)</th><td>⠓</td><th>ル (ru)</th><td>⠙</td><th>レ (re)</th><td>⠛</td><th>ロ (ro)</th><td>⠚</td></tr>
		<tr><th>ワ (wa)</th><td>⠄</td><th>ヰ (wi)</th><td>⠆</td><th></th><td></td><th>ヱ (we)</th><td>⠖</td><th>ヲ (wo)</th><td>⠔</td></tr>
		<tr><th>ン (n)</th><td>⠴</td><th></th><td></td><th></th><td></td><th></th><td></td><th></th><td></td></tr>
	</table>
</div>
<div class="table-responsive">
	<table class="table">
		<tr><th>ッ (सोकुओन)</th><td>⠂</td><th>ー (चोन)</th><td>⠒</td></tr>
	</table>
</div>

<div class="table-responsive">
	<table class="table">
		<tr><th>ガ (ga)</th><td>⠐⠡</td><th>ギ (gi)</th><td>⠐⠣</td><th>グ (gu)</th><td>⠐⠩</td><th>ゲ (ge)</th><td>⠐⠫</td><th>ゴ (go)</th><td>⠐⠪</td></tr>
		<tr><th>ザ (za)</th><td>⠐⠱</td><th>ジ (ji)</th><td>⠐⠳</td><th>ズ (zu)</th><td>⠐⠹</td><th>ゼ (ze)</th><td>⠐⠻</td><th>ゾ (zo)</th><td>⠐⠺</td></tr>
		<tr><th>ダ (da)</th><td>⠐⠕</td><th>ヂ (ji)</th><td>⠐⠗</td><th>ヅ (zu)</th><td>⠐⠝</td><th>デ (de)</th><td>⠐⠟</td><th>ド (do)</th><td>⠐⠞</td></tr>
		<tr><th>バ (ba)</th><td>⠐⠥</td><th>ビ (bi)</th><td>⠐⠧</td><th>ブ (bu)</th><td>⠐⠭</td><th>बे (be)</th><td>⠐⠯</td><th>बो (bo)</th><td>⠐⠮</td></tr>
	</table>
</div>
<div class="table-responsive">
	<table class="table">
		<tr><th>पा (pa)</th><td>⠠⠥</td><th>पी (pi)</th><td>⠠⠧</td><th>पु (pu)</th><td>⠠⠭</td><th>पे (pe)</th><td>⠠⠯</td><th>पो (po)</th><td>⠠⠮</td></tr>
	</table>
</div>

<div class="table-responsive">
	<table class="table">
		<tr><th>キャ (kya)</th><td>⠈⠡</td><th>キュ (kyu)</th><td>⠈⠩</td><th>キョ (kyo)</th><td>⠈⠪</td></tr>
		<tr><th>シャ (sha)</th><td>⠈⠱</td><th>シュ (shu)</th><td>⠈⠹</td><th>ショ (sho)</th><td>⠈⠺</td></tr>
		<tr><th>チャ (cha)</th><td>⠈⠕</td><th>チュ (chu)</th><td>⠈⠝</td><th>チョ (cho)</th><td>⠈⠞</td></tr>
		<tr><th>ニャ (nya)</th><td>⠈⠅</td><th>ニュ (nyu)</th><td>⠈⠍</td><th>ニョ (nyo)</th><td>⠈⠎</td></tr>
		<tr><th>ヒャ (hya)</th><td>⠈⠥</td><th>ヒュ (hyu)</th><td>⠈⠭</td><th>ヒョ (hyo)</th><td>⠈⠮</td></tr>
		<tr><th>ミャ (mya)</th><td>⠈⠵</td><th>ミュ (myu)</th><td>⠈⠽</td><th>ミョ (myo)</th><td>⠈⠾</td></tr>
		<tr><th>リャ (rya)</th><td>⠈⠑</td><th>リュ (ryu)</th><td>⠈⠙</td><th>リョ (ryo)</th><td>⠈⠚</td></tr>
	</table>
</div>
<div class="table-responsive">
	<table class="table">
		<tr><th>ギャ (gya)</th><td>⠘⠡</td><th>ギュ (gyu)</th><td>⠘⠩</td><th>ギョ (gyo)</th><td>⠘⠪</td></tr>
		<tr><th>ジャ (ja)</th><td>⠘⠱</td><th>ジュ (ju)</th><td>⠘⠹</td><th>ジョ (jo)</th><td>⠘⠺</td></tr>
		<tr><th>ヂャ (ja)</th><td>⠘⠕</td><th>ヂュ (ju)</th><td>⠘⠝</td><th>ヂョ (jo)</th><td>⠘⠞</td></tr>
		<tr><th>ビャ (bya)</th><td>⠘⠥</td><th>ビュ (byu)</th><td>⠘⠭</td><th>ビョ (byo)</th><td>⠘⠮</td></tr>
	</table>
</div>
<div class="table-responsive">
	<table class="table">
		<tr><th>ピャ (pya)</th><td>⠨⠥</td><th>ピュ (pyu)</th><td>⠨⠭</td><th>ピョ (pyo)</th><td>⠨⠮</td></tr>
	</table>
</div>

<h4>मुख्य प्रतीक</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>、 (जापानी कॉमा)</th><td>⠰</td><th>。 (जापानी पूर्ण विराम)</th><td>⠲</td><th>？ (प्रश्न चिह्न)</th><td>⠢</td><th>！ (विस्मयादिबोधक)</th><td>⠖</td></tr>
		<tr><th>・ (मध्य बिंदु)</th><td>⠐</td><th>〜 (वेव डैश)</th><td>⠤⠤</td><th>＆ (एम्परसेंड)</th><td>⠰⠯</td><th>％ (प्रतिशत)</th><td>⠰⠏</td></tr>
	</table>
</div>

<h4>उद्धरण और कोष्ठक</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>「 *** 」 (जाप. एकल उद्धरण)</th><td>⠤ *** ⠤</td><th>『 *** 』 (जाप. दोहरा उद्धरण)</th><td>⠰⠤ *** ⠤⠆</td></tr>
		<tr><th>（ *** ） (चौड़ा गोल कोष्ठक)</th><td>⠶ *** ⠶</td><th>｟ *** ｠ (दोहरे गोल कोष्ठक)</th><td>⠰⠶ *** ⠶⠆</td></tr>
	</table>
</div>

<h4>विदेशी वर्णमाला</h4>
<p>
जब अंग्रेजी या अन्य विदेशी वर्णमाला जापानी पाठ के साथ मिश्रित होती है, तो विजातीय-भाषा सूचक (<code>⠰</code>) ठीक वर्णमाला के सामने डाला जाता है, इसके बाद समतुल्य UEB ब्रेल होता है।
</p>

<h4>संख्याएं</h4>
<p>
नियम अंग्रेजी ब्रेल के समान ही हैं।
</p>

<h4>शब्द पृथक्करण (वाकाचीगाकी)</h4>
<p>
DenCode प्राकृतिक जापानी शब्दों के किसी भी शब्द पृथक्करण को स्वचालित रूप से सम्मिलित करेगा नहीं, बल्कि यह आपके द्वारा प्रदान की गई स्ट्रिंग को वैसे ही परिवर्तित कर देगा। अधिक सटीक जापानी ब्रेल अनुवाद प्राप्त करने के लिए, कृपया पहले से ही शब्दों को रिक्त स्थान से अलग करके अपना पाठ दर्ज करें (वाकाचीगाकी)।
</p>


<h3>ब्रेल का इतिहास</h3>
<p>
आधुनिक 6-बिंदु ब्रेल का आविष्कार 1825 में फ्रांसीसी लुइस ब्रेल द्वारा किया गया था।
उन्होंने बचपन में एक दुर्घटना में अपनी दृष्टि खो दी थी और केवल 15 वर्ष की आयु में इस प्रणाली के ढांचे को परिपूर्ण किया।
नेत्रहीनों के लिए पिछले पढ़ने के सिस्टम आम तौर पर कागज पर मानक वर्णमाला के अक्षरों को उभरा हुआ छापने पर निर्भर करते थे, जो पढ़ने और हाथ से लिखने दोनों में बेहद बोझिल थे।
उभरे हुए 6 बिंदुओं के अभूतपूर्व उपयोग ने लोगों को उंगलियों के माध्यम से तेज गति से इसे आसानी से पढ़ने में सक्षम बनाया, साथ ही इसे सरल यांत्रिक उपकरणों के माध्यम से स्वतंत्र रूप से लिखने में भी मदद की। आज, "ब्रेल" शब्द बिंदु लेखन के पर्याय के रूप में पूरी दुनिया में गहराई से स्थापित हो गया है।
</p>
<p>
जापान के संबंध में, ब्रेल को अपनाने के लिए शोध मीजी युग की शुरुआत के आसपास शुरू हुआ था।
वर्ष 1890 (मीजी 23) में, 6 बिंदुओं के आधार पर जापानी ब्रेल और वर्तमान 'काना' की प्रणाली को टोक्यो स्कूल फॉर द ब्लाइंड एंड डंब के एक शिक्षक, कुराजी इशिकावा द्वारा अंतिम रूप दिया गया था।
आजकल, 1 नवंबर - वह दिन जब इशिकावा की प्रणाली को आधिकारिक तौर पर स्थापित किया गया था - अभी भी स्मारक "ब्रेल दिवस" के रूप में मनाया जाता है।
</p>

<h3>अंग्रेजी प्रणाली में विकास और UEB</h3>
<p>
अंग्रेजी भाषी दुनिया लंबे समय से भौगोलिक स्थान के आधार पर अलग-अलग ब्रेल नियमों का उपयोग करने की प्रवृत्ति रखती थी।
उदाहरण के लिए, संयुक्त राज्य अमेरिका में, मानक को मुख्य रूप से 'इंग्लिश ब्रेल, अमेरिकन एडिशन' (EBAE) के रूप में जाना जाता था, जबकि यूनाइटेड किंगडम में यह 'स्टैंडर्ड इंग्लिश ब्रेल' (SEB) था। हालांकि दोनों एक ही अंग्रेजी भाषा साझा करते थे, लेकिन संकुचन या प्रतीकों के विनिर्देशों में अंतर थे।
इसके अलावा, विशेष क्षेत्रों के लिए जटिल सिस्टम थे, जैसे गणित और विज्ञान के लिए "नेमेथ कोड" और कंप्यूटर के लिए "कंप्यूटर ब्रेल कोड", जिसने शिक्षार्थियों और सॉफ्टवेयर डेवलपर्स को अनावश्यक भ्रम में डाल दिया।
</p>
<p>
इन भौगोलिक असमानताओं और क्षेत्र-विशिष्ट कोड के प्रसार से निपटने के लिए, 1990 के दशक की शुरुआत में एक एकीकृत अंतरराष्ट्रीय मानक बनाने के लिए एक आंदोलन शुरू किया गया था।
इस प्रयास के परिणामस्वरूप अंततः <strong>यूनिफाइड इंग्लिश ब्रेल (UEB)</strong> का विकास हुआ, जो आज दुनिया भर के अंग्रेजी बोलने वाले देशों में सामान्य मानक बन गया है।
</p>
<p>
पुराने सिस्टम (जैसे EBAE) की तुलना में UEB के तहत सबसे महत्वपूर्ण परिवर्तनों में से एक ग्रेड 2 ब्रेल की संकुचन प्रणाली का संशोधन और उन्मूलन है।
अतीत में, पाठ को छोटा करने के प्रयास में "संकुचन" के कई जटिल और भ्रमित करने वाले रूप बनाए गए थे, लेकिन UEB ने कुछ भ्रामक संकुचनों (जैसे 'ble' या 'com') को खत्म कर दिया।
इसके अतिरिक्त, UEB ने URL और ईमेल पते जैसे वेब से संबंधित पाठों में संकुचन का उपयोग न करने का एक नियम स्थापित किया, और <code>@</code> और <code>/</code> जैसे आधुनिक प्रतीकों के लिए नए ब्रेल संकेतन जोड़े, इस प्रकार आधुनिक सूचना समाज की जरूरतों को पूरी तरह से अनुकूलित किया।
</p>
<p>
वर्तमान में, संयुक्त राज्य अमेरिका, ब्रिटेन, ऑस्ट्रेलिया, कनाडा और न्यूजीलैंड जैसे प्रमुख अंग्रेजी भाषी देश UEB में संक्रमण कर चुके हैं। शिक्षण सामग्री सहित अंग्रेजी ब्रेल में अधिकांश प्रकाशन अब UEB विनिर्देशों के तहत तैयार किए जा रहे हैं।
</p>
