<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>Unicode Escape Sequence के बारे में</h3>
<p>स्ट्रिंग को Unicode Escape Sequence प्रारूप में बदलता है।</p>
<p>Unicode Escape Sequence एक वर्ण को \uXXXX जैसे 4-अंकीय हेक्साडेसिमल कोडपॉइंट प्रारूप में परिवर्तित करता है। उदाहरण के लिए, "あ" "\u3042" हो जाता है।</p>

<p>DenCode \uXXXX प्रारूप के अलावा निम्नलिखित नोटेशन प्रारूपों का भी समर्थन करता है।</p>

<div class="table-responsive">
	<table class="table">
		<tr><th scope="col">प्रारूप</th><th scope="col">"ABC" का रूपांतरण परिणाम</th><th scope="col">विवरण / प्रोग्रामिंग भाषा</th></tr>
		<tr><td>\uXXXX</td><td>\u0041\u0042\u0043</td><td>General Unicode Escape Sequence</td></tr>
		<tr><td>\u{X}</td><td>\u{41}\u{42}\u{43}</td><td>Lua</td></tr>
		<tr><td>\x{X}</td><td>\x{41}\x{42}\x{43}</td><td>Perl</td></tr>
		<tr><td>\X</td><td>\41\42\43</td><td>CSS</td></tr>
		<tr><td>&amp;#xX;</td><td>&amp;#x41;&amp;#x42;&amp;#x43;</td><td>HTML, XML</td></tr>
		<tr><td>%uXXXX</td><td>%u0041%u0042%u0043</td><td>Percent Encoding (गैर-मानक)</td></tr>
		<tr><td>U+XXXX</td><td>U+0041 U+0042 U+0043</td><td>कोडपॉइंट का Unicode मानक नोटेशन (स्पेस से अलग)</td></tr>
		<tr><td>0xX</td><td>0x41 0x42 0x43</td><td>कोडपॉइंट का हेक्साडेसिमल नोटेशन (स्पेस से अलग)</td></tr>
	</table>
</div>

<p>उपरोक्त कुछ प्रारूप <a href="https://www.rfc-editor.org/rfc/rfc5137" target="_blank">RFC 5137 (ASCII Escaping of Unicode Characters)</a> में BEST CURRENT PRACTICE के रूप में वर्णित हैं, लेकिन कोई अंतरराष्ट्रीय मानक नहीं है।</p>
<p>%uXXXX प्रारूप Microsoft IIS द्वारा समर्थित है, लेकिन यह एक गैर-मानक प्रारूप है। C# के <a href="https://learn.microsoft.com/en-us/dotnet/api/system.web.httputility.urlencodeunicode" target="_blank">System.Web.HttpUtility.UrlEncodeUnicode</a> से %u प्रारूप में एन्कोड किया जा सकता है, लेकिन यह विधि .NET Framework 4.5 से पदावनत (deprecated) है।</p>
<p>\X प्रारूप के लिए, कृपया ध्यान दें कि <a href="https://www.w3.org/International/questions/qa-escapes" target="_blank">CSS विनिर्देश</a> के रूप में, डिकोडिंग के दौरान बाद में आने वाले एक आधे-चौड़ाई वाले स्थान (half-width space) को सीमांकक (delimiter) के रूप में माना जाता है और अनदेखा कर दिया जाता है। U+XXXX या 0xX प्रारूप में, एन्कोडिंग के दौरान प्रत्येक वर्ण को आधे-चौड़ाई वाले स्थान से अलग किया जाता है, और डिकोडिंग के दौरान \X प्रारूप की तरह बाद में आने वाले निरंतर आधे-चौड़ाई वाले स्थान को अनदेखा कर दिया जाता है।</p>


<h4>Unicode नाम द्वारा Escape (Escape by Unicode Name)</h4>

<p>Unicode Escape Sequence के रूप में, हम Unicode नामों द्वारा एस्केप का भी समर्थन करते हैं।</p>

<div class="table-responsive">
	<table class="table">
		<tr><th scope="col">प्रारूप</th><th scope="col">"A" का रूपांतरण परिणाम</th><th scope="col">विवरण / प्रोग्रामिंग भाषा</th></tr>
		<tr><td>\N{name}</td><td>\N{LATIN CAPITAL LETTER A}</td><td>C++23, Python, Perl</td></tr>
	</table>
</div>

<p>Unicode नामों की पुष्टि <a href="https://unicode.org/charts/nameslist/" target="_blank">Names List Charts - Unicode</a> या <a href="https://www.unicode.org/Public/15.0.0/ucd/NamesList.txt" target="_blank">NamesList.txt - Unicode</a> पर की जा सकती है।</p>


<h4>Unicode Escape Sequence में Unicode BMP सीमा से बाहर के वर्ण</h4>

<p>Unicode के गैर-BMP वर्णों के लिए, क्योंकि कोडपॉइंट 4 अंकों में फिट नहीं होते हैं, इसलिए उन्हें प्रोग्रामिंग भाषा के अनुसार निम्नलिखित नोटेशन प्रारूपों में दर्शाया जाता है।</p>
<p>उदाहरण के लिए, "😀"(U+1F600) को बदलने पर परिणाम इस प्रकार है।</p>

<div class="table-responsive">
	<table class="table">
		<tr><th scope="col">प्रारूप</th><th scope="col">"😀"(U+1F600) का रूपांतरण परिणाम</th><th scope="col">प्रोग्रामिंग भाषा</th></tr>
		<tr><td>\uXXXX</td><td>\uD83D\uDE00</td><td>Java, Kotlin, Scala</td></tr>
		<tr><td>\u{X}</td><td>\u{1F600}</td><td>C++23, Rust, Swift, JavaScript, PHP, Ruby, Dart, Lua</td></tr>
		<tr><td>\U00XXXXXX</td><td>\U0001F600</td><td>C, C++, Objective-C, C#, Go, Python, R</td></tr>
		<tr><td>\x{X}</td><td>\x{1F600}</td><td>Perl</td></tr>
		<tr><td>\X</td><td>\1F600</td><td>CSS</td></tr>
		<tr><td>&amp;#xX;</td><td>&amp;#x1F600;</td><td>HTML, XML</td></tr>
		<tr><td>%uXXXX</td><td>%uD83D%uDE00</td><td>-</td></tr>
		<tr><td>U+XXXX</td><td>U+1F600</td><td>-</td></tr>
		<tr><td>0xX</td><td>0x1F600</td><td>-</td></tr>
		<tr><td>\N{name}</td><td>\N{GRINNING FACE}</td><td>C++23, Python, Perl</td></tr>
	</table>
</div>

<p>\uXXXX और %uXXXX प्रारूप में, गैर-BMP वर्णों को UTF-16 के सरोगेट पेयर (surrogate pair) के रूप में 2 कोड यूनिट्स में दर्शाया जाता है। अन्य प्रारूपों में, 1 वर्ण को 1 कोडपॉइंट द्वारा दर्शाया जाता है।</p>
