<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>W3C-DTF दिनांक (Date) के बारे में</h3>
<p>W3C-DTF, <a href="https://www.w3.org/TR/NOTE-datetime" target="_blank">W3C के NOTE-datetime</a> में परिभाषित दिनांक और समय प्रारूप है। यह ISO 8601 के प्रारूपों का एक सीमित सबसेट है।</p>
<p>दिनांक और समय को "T" से जोड़कर लिखा जाता है। समय क्षेत्र (Timezone) को UTC से अंतर के रूप में "+09:00" की तरह लिखा जाता है, और UTC के मामले में "Z" से दर्शाया जाता है।</p>
<p>सेकंड और मिलीसेकंड के बीच डॉट (.) का उपयोग किया जाता है।</p>

<p>W3C-DTF का उपयोग HTTP हेडर और RSS में दिनांक और समय表記 के रूप में किया जाता है।</p>

<p>उदाहरण के लिए, 2000-01-23 01:23:45.678 (JST; +09:00) को W3C-DTF में परिवर्तित करने पर निम्नलिखित परिणाम प्राप्त होता है।</p>

<pre>2000-01-23T01:23:45.678+09:00</pre>
