<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>हेक्साडेसिमल स्ट्रिंग (Hexadecimal String) के बारे में</h3>
<p>हेक्साडेसिमल स्ट्रिंग, स्ट्रिंग के बाइनरी मान को हेक्साडेसिमल नोटेशन में व्यक्त करती है।</p>
<p>चूँकि कैरेक्टर एन्कोडिंग के आधार पर बाइनरी मान भिन्न होते हैं, इसलिए हेक्साडेसिमल स्ट्रिंग में रूपांतरण के परिणाम भी भिन्न होते हैं।</p>

<p>उदाहरण के लिए, "サンプル" (Sample) को हेक्साडेसिमल स्ट्रिंग में बदलने पर परिणाम इस प्रकार होगा।</p>

<div class="table-responsive">
	<table class="table">
		<tr><th>कैरेक्टर एन्कोडिंग</th><th>हेक्साडेसिमल स्ट्रिंग</th></tr>
		<tr><td>UTF-8</td><td>E3 82 B5 E3 83 B3 E3 83 97 E3 83 AB</td></tr>
		<tr><td>UTF-16</td><td>30 B5 30 F3 30 D7 30 EB</td></tr>
		<tr><td>Shift_JIS</td><td>83 54 83 93 83 76 83 8B</td></tr>
	</table>
</div>
