<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>मोर्स कोड के बारे में</h3>
<p>
मोर्स कोड (Morse code) एक टेलीग्राफ कोडिंग प्रणाली है जो छोटे संकेतों (Dit) और लंबे संकेतों (Dah) के संयोजन से अक्षरों और प्रतीकों को व्यक्त करती है।
</p>

<p>
DenCode मोर्स कोड को दर्शाने के लिए निम्नलिखित प्रतीकों का उपयोग करता है।
</p>

<div class="table-responsive">
	<table class="table">
		<tr><th>नाम</th><th>प्रतीक</th></tr>
		<tr><td>Dit (लघु बिंदु)</td><td><code>.</code> (डॉट)</td></tr>
		<tr><td>Dah (दीर्घ बिंदु)</td><td><code>-</code> (हाइफ़न)</td></tr>
		<tr><td>अक्षर अंतराल (Letter space)</td><td><code> </code> (स्पेस)</td></tr>
		<tr><td>शब्द अंतराल (Word space)</td><td><code>/</code> (स्लैश)</td></tr>
	</table>
</div>

<p>
"<var>MORSE CODE</var>" को अंतर्राष्ट्रीय मोर्स कोड में बदलने का परिणाम इस प्रकार है।
</p>
<pre>
M   O   R   S  E    C    O   D  E
-- --- .-. ... . / -.-. --- -.. .
</pre>

<h4>सिग्नल टाइमिंग</h4>
<p>
मोर्स कोड प्रेषित करते समय, Dit और Dah की लंबाई और उनके बीच के अंतराल के लिए सख्त अनुपात निर्धारित हैं।
Dit की लंबाई को 1 इकाई मानते हुए, प्रत्येक तत्व की लंबाई इस प्रकार है।
</p>

<div class="table-responsive">
	<table class="table">
		<tr><th>तत्व</th><th>लंबाई</th><th>विवरण</th></tr>
		<tr><td>Dit</td><td>1 इकाई</td><td>एक छोटा सिग्नल टोन</td></tr>
		<tr><td>Dah</td><td>3 इकाई</td><td>Dit की 3 गुना लंबाई का सिग्नल टोन</td></tr>
		<tr><td>कोड-अंतर अंतराल</td><td>1 इकाई</td><td>एक ही अक्षर के भीतर Dit और Dah के बीच मौन अंतराल</td></tr>
		<tr><td>अक्षर अंतराल</td><td>3 इकाई</td><td>विभिन्न अक्षरों के बीच मौन अंतराल</td></tr>
		<tr><td>शब्द अंतराल</td><td>7 इकाई</td><td>विभिन्न शब्दों के बीच मौन अंतराल</td></tr>
	</table>
</div>

<p>
उदाहरण के लिए, "<var>MORSE CODE</var>" प्रेषित करते समय, सिग्नल निम्नलिखित टाइमिंग से भेजा जाता है।
<code>▄</code> (<code>1</code>) सिग्नल टोन को दर्शाता है, और <code> </code> (<code>0</code>) मौन अंतराल को दर्शाता है।
</p>
<pre>
M    : ▄▄▄ ▄▄▄         (1110111)
O    : ▄▄▄ ▄▄▄ ▄▄▄     (11101110111)
R    : ▄ ▄▄▄ ▄         (1011101)
S    : ▄ ▄ ▄           (10101)
E    : ▄               (1)
     :                 (0000000)
C    : ▄▄▄ ▄ ▄▄▄ ▄     (11101011101)
O    : ▄▄▄ ▄▄▄ ▄▄▄     (11101110111)
D    : ▄▄▄ ▄ ▄         (1110101)
E    : ▄               (1)

   M           O           R        S     E            C             O           D      E
▄▄▄ ▄▄▄   ▄▄▄ ▄▄▄ ▄▄▄   ▄ ▄▄▄ ▄   ▄ ▄ ▄   ▄       ▄▄▄ ▄ ▄▄▄ ▄   ▄▄▄ ▄▄▄ ▄▄▄   ▄▄▄ ▄ ▄   ▄
11101110001110111011100010111010001010100010000000111010111010001110111011100011101010001
</pre>

<p>
इस प्रकार, Dit की 1 इकाई को आधार मानकर सभी लंबाइयाँ पूर्णांक अनुपात में निर्धारित होती हैं, जिससे प्रेषण गति बदलने पर भी सटीक अनुपात बनाए रखा जा सकता है।
संचार गति आम तौर पर WPM (Words Per Minute) में व्यक्त की जाती है, जो संदर्भ शब्द "PARIS" को प्रति मिनट कितनी बार प्रेषित किया जा सकता है, इससे परिभाषित होती है।
उदाहरण के लिए, 20 WPM पर एक Dit इकाई लगभग 60 मिलीसेकंड होती है।
</p>


<h3>अंतर्राष्ट्रीय मोर्स कोड</h3>
<p>
अंतर्राष्ट्रीय मोर्स कोड अक्षरों, संख्याओं और प्रतीकों को दर्शाने के लिए विश्व मानक मोर्स कोड है।
इसे अंतर्राष्ट्रीय दूरसंचार संघ (ITU) के मानक (ITU-R M.1677-1) द्वारा परिभाषित किया गया है।
</p>

<h4>वर्णमाला</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>A</th><td>.-</td><th>B</th><td>-...</td><th>C</th><td>-.-.</td><th>D</th><td>-..</td></tr>
		<tr><th>E</th><td>.</td><th>F</th><td>..-.</td><th>G</th><td>--.</td><th>H</th><td>....</td></tr>
		<tr><th>I</th><td>..</td><th>J</th><td>.---</td><th>K</th><td>-.-</td><th>L</th><td>.-..</td></tr>
		<tr><th>M</th><td>--</td><th>N</th><td>-.</td><th>O</th><td>---</td><th>P</th><td>.--.</td></tr>
		<tr><th>Q</th><td>--.-</td><th>R</th><td>.-.</td><th>S</th><td>...</td><th>T</th><td>-</td></tr>
		<tr><th>U</th><td>..-</td><th>V</th><td>...-</td><th>W</th><td>.--</td><th>X</th><td>-..-</td></tr>
		<tr><th>Y</th><td>-.--</td><th>Z</th><td>--..</td><th></th><td></td><th></th><td></td></tr>
	</table>
</div>

<h4>अंक</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>1</th><td>.----</td><th>2</th><td>..---</td><th>3</th><td>...--</td><th>4</th><td>....-</td><th>5</th><td>.....</td></tr>
		<tr><th>6</th><td>-....</td><th>7</th><td>--...</td><th>8</th><td>---..</td><th>9</th><td>----.</td><th>0</th><td>-----</td></tr>
	</table>
</div>

<h4>प्रतीक</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>.</th><td>.-.-.-</td><th>,</th><td>--..--</td><th>?</th><td>..--..</td><th>!</th><td>-.-.--</td></tr>
		<tr><th>=</th><td>-...-</td><th>/</th><td>-..-.</td><th>+</th><td>.-.-.</td><th>-</th><td>-....-</td></tr>
		<tr><th>'</th><td>.----.</td><th>"</th><td>.-..-.</td><th>(</th><td>-.--.</td><th>)</th><td>-.--.-</td></tr>
		<tr><th>@</th><td>.--.-.</td><th>&amp;</th><td>.-...</td><th>:</th><td>---...</td><th>;</th><td>-.-.-.</td></tr>
		<tr><th>_</th><td>..--.-</td><th>$</th><td>...-..-</td><th>^</th><td>......</td><th></th><td></td></tr>
	</table>
</div>

<h4>विस्तारित कोड</h4>
<p>
विशेषक चिह्नों वाले अक्षरों में, केवल "É" को अंतर्राष्ट्रीय दूरसंचार संघ (ITU) द्वारा परिभाषित किया गया है। अन्य सभी कोड राष्ट्रीय अधिकारियों या परंपरा द्वारा स्थापित "विस्तारित कोड" के रूप में परिभाषित हैं।
</p>
<div class="table-responsive">
	<table class="table">
		<tr><th>À, Å</th><td>.--.-</td><th>Ä, Æ, Ą</th><td>.-.-</td><th>Ć, Ĉ, Ç</th><td>-.-..</td><th>É, Ę, Đ</th><td>..-..</td></tr>
		<tr><th>Ð</th><td>..--.</td><th>È, Ł</th><td>.-..-</td><th>Ĝ</th><td>--.-.</td><th>Ĥ, Š</th><td>----</td></tr>
		<tr><th>Ĵ</th><td>.---.</td><th>Ń, Ñ</th><td>--.--</td><th>Ó, Ö, Ø</th><td>---.</td><th>Ś</th><td>...-...</td></tr>
		<tr><th>Ŝ</th><td>...-.</td><th>Þ</th><td>.--..</td><th>Ü, Ŭ</th><td>..--</td><th>Ź</th><td>--..-.</td></tr>
		<tr><th>Ż</th><td>--..-</td><th></th><td></td><th></th><td></td><th></th><td></td></tr>
	</table>
</div>


<h3>जापानी मोर्स कोड (वाबुन कोड)</h3>
<p>
जापानी मोर्स कोड जापानी हिरागाना और काताकाना अक्षरों को व्यक्त करने के लिए डिज़ाइन किया गया मोर्स कोड सिस्टम है।
अक्षरों का क्रम पारंपरिक "इरोहा" क्रम पर आधारित है।
</p>

<h4>हिरागाना / काताकाना (इरोहा क्रम)</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>イ</th><td>.-</td><th>ロ</th><td>.-.-</td><th>ハ</th><td>-...</td><th>ニ</th><td>-.-.</td><th>ホ</th><td>-..</td></tr>
		<tr><th>ヘ</th><td>.</td><th>ト</th><td>..-..</td><th>チ</th><td>..-.</td><th>リ</th><td>--.</td><th>ヌ</th><td>....</td></tr>
		<tr><th>ル</th><td>-.--.</td><th>ヲ</th><td>.---</td><th>ワ</th><td>-.-</td><th>カ</th><td>.-..</td><th>ヨ</th><td>--</td></tr>
		<tr><th>タ</th><td>-.</td><th>レ</th><td>---</td><th>ソ</th><td>---.</td><th>ツ</th><td>.--.</td><th>ネ</th><td>--.-</td></tr>
		<tr><th>ナ</th><td>.-.</td><th>ラ</th><td>...</td><th>ム</th><td>-</td><th>ウ</th><td>..-</td><th>ヰ</th><td>.-..-</td></tr>
		<tr><th>ノ</th><td>..--</td><th>オ</th><td>.-...</td><th>ク</th><td>...-</td><th>ヤ</th><td>.--</td><th>マ</th><td>-..-</td></tr>
		<tr><th>ケ</th><td>-.--</td><th>フ</th><td>--..</td><th>コ</th><td>----</td><th>エ</th><td>-.---</td><th>テ</th><td>.-.--</td></tr>
		<tr><th>ア</th><td>--.--</td><th>サ</th><td>-.-.-</td><th>キ</th><td>-.-..</td><th>ユ</th><td>-..--</td><th>メ</th><td>-...-</td></tr>
		<tr><th>ミ</th><td>..-.-</td><th>シ</th><td>--.-.</td><th>ヱ</th><td>.--..</td><th>ヒ</th><td>--..-</td><th>モ</th><td>-..-.</td></tr>
		<tr><th>セ</th><td>.---.</td><th>ス</th><td>---.-</td><th>ン</th><td>.-.-.</td><th></th><td></td><th></th><td></td></tr>
	</table>
</div>
<div class="table-responsive">
	<table class="table">
		<tr><th>゛ (डाकुटेन / सघोष चिह्न)</th><td>..</td><th>゜ (हानडाकुटेन / अर्ध-सघोष चिह्न)</th><td>..--.</td></tr>
	</table>
</div>

<p>
डाकुटेन (゛) और हानडाकुटेन (゜) के अपने स्वतंत्र कोड हैं। इन्हें आधार अक्षर कोड के बाद अक्षर अंतराल (स्पेस) रखकर डाकुटेन कोड (<code>..</code>) या हानडाकुटेन कोड (<code>..--.</code>) रखकर व्यक्त किया जाता है।
उदाहरण के लिए, "ガ" "カ (<code>.-..</code>)" और "゛ (<code>..</code>)" का संयोजन है, जो "<code>.-.. ..</code>" बनता है।
</p>

<h4>अंक</h4>
<p>
अंतर्राष्ट्रीय मोर्स कोड के समान।
</p>

<h4>प्रतीक</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>。</th><td>.-.-..</td><th>、</th><td>.-.-.-</td><th>ー</th><td>.--.-</td></tr>
		<tr><th>（</th><td>-.--.-</td><th>）</th><td>.-..-.</td><th></th><td></td></tr>
	</table>
</div>


<h3>रूसी (सिरिलिक) मोर्स कोड</h3>
<p>
यह रूसी और अन्य भाषाओं में उपयोग होने वाले सिरिलिक अक्षरों को व्यक्त करने के लिए डिज़ाइन किया गया मोर्स कोड सिस्टम है।
कोड सिरिलिक वर्णमाला क्रम में नहीं हैं, बल्कि उच्चारण के आधार पर संबंधित लैटिन अक्षरों (अंतर्राष्ट्रीय मोर्स कोड) के समान कोड दिए गए हैं।
</p>

<div class="table-responsive">
	<table class="table">
		<tr><th>А</th><td>.-</td><th>Б</th><td>-...</td><th>В</th><td>.--</td><th>Г</th><td>--.</td></tr>
		<tr><th>Д</th><td>-..</td><th>Е</th><td>.</td><th>Ж</th><td>...-</td><th>З</th><td>--..</td></tr>
		<tr><th>И</th><td>..</td><th>Й</th><td>.---</td><th>К</th><td>-.-</td><th>Л</th><td>.-..</td></tr>
		<tr><th>М</th><td>--</td><th>Н</th><td>-.</td><th>О</th><td>---</td><th>П</th><td>.--.</td></tr>
		<tr><th>Р</th><td>.-.</td><th>С</th><td>...</td><th>Т</th><td>-</td><th>У</th><td>..-</td></tr>
		<tr><th>Ф</th><td>..-.</td><th>Х</th><td>....</td><th>Ц</th><td>-.-.</td><th>Ч</th><td>---.</td></tr>
		<tr><th>Ш</th><td>----</td><th>Щ</th><td>--.-</td><th>Ъ</th><td>--.--</td><th>Ы</th><td>-.--</td></tr>
		<tr><th>Ь</th><td>-..-</td><th>Э</th><td>..-..</td><th>Ю</th><td>..--</td><th>Я</th><td>.-.-</td></tr>
	</table>
</div>

<h4>अंक</h4>
<p>
अंतर्राष्ट्रीय मोर्स कोड के समान।
</p>

<h4>प्रतीक</h4>
<div class="table-responsive">
	<table class="table">
		<tr><th>.</th><td>......</td><th>,</th><td>.-.-.-</td><th>?</th><td>..--..</td><th>!</th><td>--..--</td></tr>
		<tr><th>'</th><td>.----.</td><th>"</th><td>.-..-.</td><th>:</th><td>---...</td><th>;</th><td>-.-.-</td></tr>
		<tr><th>=</th><td>-...-</td><th>/</th><td>-..-.</td><th>-</th><td>-....-</td><th>()</th><td>-.--.-</td></tr>
		<tr><th>@</th><td>.--.-.</td><th></th><td></td><th></th><td></td><th></th><td></td></tr>
	</table>
</div>


<h3>मोर्स कोड का इतिहास</h3>
<p>
1830 के दशक में अमेरिकी आविष्कारक सैमुएल मोर्स (Samuel Morse) और अल्फ्रेड वेल (Alfred Vail) द्वारा प्रारंभिक टेलीग्राफ मशीनों के लिए विकसित किया गया था।
पहला मोर्स कोड केवल संख्याएँ भेजता था, जिन्हें प्राप्तकर्ता पक्ष पर शब्दकोश का उपयोग करके शब्दों में बदला जाता था। बाद में वेल ने वर्णमाला को शामिल करके वर्तमान प्रणाली में विस्तार किया।
अधिक बार उपयोग होने वाले अक्षरों (जैसे <code>E</code>) को छोटे कोड (<code>.</code>) और कम उपयोग होने वाले अक्षरों (जैसे <code>Q</code>) को लंबे कोड (<code>--.-</code>) दिए गए, जिससे संचार दक्षता का अनुकूलन किया गया।
</p>

<p>
इसके बाद, विशेष रूप से यूरोप में अंतर्राष्ट्रीय संचार की माँग से, वर्णमाला आवंटन को संशोधित किया गया और यह आज विश्व भर में उपयोग होने वाले "अंतर्राष्ट्रीय मोर्स कोड (International Morse Code)" में विकसित हुआ।
जापान में, एदो काल के अंत से मेइजी काल की शुरुआत तक जब टेलीग्राफ तकनीक आयात की गई, तो जापानी काना (50 ध्वनियों) को विशिष्ट रूप से मोर्स कोड में मैप करके "वाबुन मोर्स कोड" तैयार किया गया।
वाबुन मोर्स की एक विशेष विशेषता यह है कि कोड पारंपरिक "इरोहा" क्रम ("イロハニホヘト…") में आवंटित किए गए हैं।
</p>

<p>
लंबे समय तक, मोर्स कोड का उपयोग दुनिया भर में समुद्री, विमानन, सैन्य और वाणिज्यिक संचार में व्यापक रूप से किया गया।
हालाँकि, उपग्रह और डिजिटल संचार के विकास के साथ, 1990 के दशक में GMDSS (समुद्री संकट और सुरक्षा की वैश्विक प्रणाली) में संक्रमण के साथ, आधिकारिक संकट संचार साधन के रूप में मोर्स कोड ने अपनी भूमिका लगभग समाप्त कर दी।
</p>

<p>
वर्तमान में यह मुख्य रूप से शौकिया रेडियो और कुछ नेविगेशन रेडियो बीकन में उपयोग किया जाता है।
हालाँकि, इसकी अत्यंत सरल ऑन-ऑफ प्रणाली (प्रकाश का झपकना, ध्वनि का छोटा-लंबा होना, यहाँ तक कि पलक झपकना या दीवार पर थपथपाना) से संवाद करने की क्षमता के कारण, प्राकृतिक आपदाओं जैसी स्थितियों में अंतिम संचार साधन के रूप में इसका मूल्य आधुनिक युग में भी बिल्कुल कम नहीं हुआ है।
प्रसिद्ध संकट संकेत "SOS" को भी किसी भाषाई अर्थ के लिए नहीं, बल्कि "<code>... --- ...</code>" संयोजन के भेजने और पहचानने में आसान होने के कारण अपनाया गया था।
</p>
