<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>Affine Cipher के बारे में</h3>
<p>Affine Cipher एक मोनोअल्फाबेटिक सब्सटीट्यूशन सिफर (monoalphabetic substitution cipher) है जो टेक्स्ट में वर्णों को अन्य वर्णों से बदलकर एन्क्रिप्ट करता है।</p>
<p>वर्णों का प्रतिस्थापन निम्नलिखित सूत्र द्वारा किया जाता है।</p>

<pre>E(<var>x</var>) = (<var>a</var><var>x</var> + <var>b</var>) mod <var>m</var></pre>

<p><var>m</var> परिवर्तित किए जाने वाले वर्णों के प्रकार का प्रतिनिधित्व करता है। <var>x</var> 0 से m - 1 तक की संख्याओं से बदले गए वर्ण हैं। <var>a</var> और <var>b</var> एन्क्रिप्शन की कुंजी (keys) हैं।</p>

<p>उदाहरण के लिए, "ABCDEFGHIJKLMNOPQRSTUVWXYZ" के 26 अंग्रेजी वर्णों के लिए, <var>m</var> = 26, और <var>x</var> A ~ Z को संख्याओं में बदला गया 0 ~ 25 है।</p>

<div class="table-responsive">
	<table class="table">
		<tr><th>वर्ण</th><td>A</td><td>B</td><td>C</td><td>D</td><td>E</td><td>F</td><td>G</td><td>H</td><td>I</td><td>J</td><td>K</td><td>L</td><td>M</td><td>N</td><td>O</td><td>P</td><td>Q</td><td>R</td><td>S</td><td>T</td><td>U</td><td>V</td><td>W</td><td>X</td><td>Y</td><td>Z</td></tr>
		<tr><th><var>x</var></th><td>0</td><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>7</td><td>8</td><td>9</td><td>10</td><td>11</td><td>12</td><td>13</td><td>14</td><td>15</td><td>16</td><td>17</td><td>18</td><td>19</td><td>20</td><td>21</td><td>22</td><td>23</td><td>24</td><td>25</td></tr>
	</table>
</div>

<p>यदि <var>a</var> = 5, <var>b</var> = 3 है, तो एन्क्रिप्शन निम्नानुसार किया जाता है।</p>

<div class="table-responsive">
	<table class="table">
		<tr><th>एन्क्रिप्शन से पहले</th><td>S</td><td>E</td><td>C</td><td>R</td><td>E</td><td>T</td></tr>
		<tr><th><var>x</var></th><td>18</td><td>4</td><td>2</td><td>17</td><td>4</td><td>19</td></tr>
		<tr><th>(5<var>x</var> + 3)</th><td>93</td><td>23</td><td>13</td><td>88</td><td>23</td><td>98</td></tr>
		<tr><th>(5<var>x</var> + 3) mod 26</th><td>15</td><td>23</td><td>13</td><td>10</td><td>23</td><td>20</td></tr>
		<tr><th>एन्क्रिप्शन के बाद</th><td>P</td><td>X</td><td>N</td><td>K</td><td>X</td><td>U</td></tr>
	</table>
</div>

<p><var>a</var> = 5, <var>b</var> = 3 के साथ सभी अंग्रेजी वर्णों को एन्क्रिप्ट करने का परिणाम इस प्रकार है।</p>

<pre>
एन्क्रिप्शन से पहले : ABCDEFGHIJKLMNOPQRSTUVWXYZ
एन्क्रिप्शन के बाद : DINSXCHMRWBGLQVAFKPUZEJOTY
</pre>

<p>यदि <var>a</var> = 1, <var>b</var> = -3 निर्दिष्ट किया जाता है, तो परिणाम Caesar Cipher जैसा होता है; यदि <var>a</var> = 1, <var>b</var> = 13 निर्दिष्ट किया जाता है, तो ROT13 जैसा; और यदि <var>a</var> = -1, <var>b</var> = -1 निर्दिष्ट किया जाता है, तो Atbash Cipher जैसा परिणाम प्राप्त होता है।</p>

<p><var>a</var> को <var>m</var> के साथ सहअभाज्य (coprime) संख्या होनी चाहिए। इसका मतलब है कि केवल 1 ही ऐसी संख्या होनी चाहिए जो <var>a</var> और <var>m</var> दोनों को विभाजित कर सके। उदाहरण के लिए, यदि <var>a</var> = 4, <var>m</var> = 26 है, तो इसे निर्दिष्ट नहीं किया जा सकता क्योंकि 1 के अलावा 2 भी उन्हें विभाजित कर सकता है। DenCode में, यदि अमान्य <var>a</var> निर्दिष्ट किया जाता है, तो मूल वर्ण बिना परिवर्तन के वापस कर दिए जाते हैं।</p>


<h4>अन्य भाषाओं का समर्थन</h4>
<p>लैटिन वर्णों के अलावा, सिरिलिक (Cyrillic) और जापानी हीरागाना/काताकाना का समर्थन किया जाता है।</p>

<p><var>a</var> = 5, <var>b</var> = 3 के साथ एन्क्रिप्ट करने के परिणाम क्रमशः इस प्रकार हैं।</p>

<h5>सिरिलिक (Cyrillic)</h5>
<pre>
एन्क्रिप्शन से पहले : АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ
एन्क्रिप्शन के बाद : ГИНТЧЬБЖЛРХЪЯДЙОУШЭВЗМСЦЫАЕКПФЩЮ
</pre>

<p><var>m</var> = 32 (32 वर्ण) है।</p>

<h5>जापानी हीरागाना/काताकाना</h5>
<pre>
एन्क्रिप्शन से पहले : ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔ
एन्क्रिप्शन के बाद : いぉぎこじそぢでぬぱぶほむゅりわゔぅおくごすぞっとねひぷぼめゆるゐぁうかぐさずたつどのびへぽもょれゑあぇがけざせだづなはぴべまゃよろをぃえきげしぜちてにばふぺみやらゎん
</pre>

<pre>
एन्क्रिप्शन से पहले : ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴ
एन्क्रिप्शन के बाद : イォギコジソヂデヌパブホムュリワヴゥオクゴスゾットネヒプボメユルヰァウカグサズタツドノビヘポモョレヱアェガケザセダヅナハピベマャヨロヲィエキゲシゼチテニバフペミヤラヮン
</pre>

<p>वर्णों का क्रम Unicode में परिभाषा के क्रम में है। कृपया ध्यान दें कि "ゕ", "ゖ", "ヵ", "ヶ" और "ヷ", "ヸ", "ヹ", "ヺ" एन्क्रिप्शन का विषय नहीं हैं।</p>

<p><var>m</var> = 84 (84 वर्ण) है।</p>
