<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>बाइनरी स्ट्रिंग (Binary String) के बारे में</h3>
<p>बाइनरी स्ट्रिंग, स्ट्रिंग के बाइनरी मान को बाइनरी नोटेशन में व्यक्त करती है।</p>
<p>चूँकि कैरेक्टर एन्कोडिंग के आधार पर बाइनरी मान भिन्न होते हैं, इसलिए बाइनरी स्ट्रिंग में रूपांतरण के परिणाम भी भिन्न होते हैं।</p>

<p>उदाहरण के लिए, "サンプル" (Sample) को बाइनरी स्ट्रिंग में बदलने पर परिणाम इस प्रकार होगा।</p>

<div class="table-responsive">
	<table class="table">
		<tr><th>कैरेक्टर एन्कोडिंग</th><th>बाइनरी स्ट्रिंग</th></tr>
		<tr><td>UTF-8</td><td>11100011 10000010 10110101 11100011 10000011 10110011 11100011 10000011 10010111 11100011 10000011 10101011</td></tr>
		<tr><td>UTF-16</td><td>00110000 10110101 00110000 11110011 00110000 11010111 00110000 11101011</td></tr>
		<tr><td>Shift_JIS</td><td>10000011 01010100 10000011 10010011 10000011 01110110 10000011 10001011</td></tr>
	</table>
</div>
