<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>Quoted-printable के बारे में</h3>
<p>Quoted-printable एक एन्कोडिंग विधि है जो 7-बिट प्रिंट करने योग्य ASCII वर्णों का उपयोग करती है। इसका उपयोग ईमेल में 8-बिट डेटा को 7-बिट डेटा पथ के माध्यम से स्थानांतरित करने के लिए किया जाता है।</p>
<p>Quoted-printable में, 8-बिट डेटा को 2-अंकीय हेक्साडेसिमल प्रारूप जैसे =XX में दर्शाया जाता है। उदाहरण के लिए, "あ" UTF-8 में "=E3=81=82" बन जाता है। 7-बिट प्रिंट करने योग्य वर्ण जैसे "A" परिवर्तित नहीं होते हैं।</p>


<h4>E-mail का MIME संदेश हेडर प्रारूप (Format) (RFC 2047)</h4>
<p>DenCode में, हम निम्नलिखित MIME संदेश हेडर प्रारूप (RFC 2047) के डिकोडिंग का भी समर्थन करते हैं। इस प्रारूप का उपयोग तब किया जाता है जब ईमेल के विषय या पते में ASCII के अलावा अन्य वर्ण शामिल होते हैं।</p>

<pre>Subject: =?UTF-8?Q?=E3=82=B5=E3=83=B3=E3=83=97=E3=83=AB?=</pre>

<p>डिकोडिंग के बाद परिणाम इस प्रकार है।</p>

<pre>Subject: サンプル</pre>
