<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>Caesar Cipher के बारे में</h3>
<p>Caesar Cipher एक मोनोअल्फाबेटिक सब्सटीट्यूशन सिफर (monoalphabetic substitution cipher) है जो टेक्स्ट में वर्णों को अन्य वर्णों से बदलकर एन्क्रिप्ट करता है।</p>
<p>वर्णों का प्रतिस्थापन "A" से "Z" तक के वर्णों को "ABCDEFGHIJKLMNOPQRSTUVWXYZ" के 26 वर्णों के भीतर शिफ्ट करके किया जाता है।</p>
<p>उदाहरण के लिए, यदि हम -3 वर्ण शिफ्ट करते हैं, तो "A" को "X" और "Z" को "W" में एन्क्रिप्ट किया जाता है।</p>

<pre>
एन्क्रिप्शन से पहले : ABCDEFGHIJKLMNOPQRSTUVWXYZ
एन्क्रिप्शन के बाद : XYZABCDEFGHIJKLMNOPQRSTUVW
</pre>

<pre>
एन्क्रिप्शन से पहले का टेक्स्ट : THIS IS A SECRET MESSAGE
एन्क्रिप्शन के बाद का टेक्स्ट : QEFP FP X PBZOBQ JBPPXDB
</pre>

<p>शिफ्ट की जाने वाली संख्या एन्क्रिप्शन की कुंजी (key) होती है।</p>
<p>केवल अंग्रेजी वर्ण एन्क्रिप्ट किए जाते हैं, और संख्याएं और प्रतीक एन्क्रिप्ट नहीं होते हैं।</p>
<p>यदि शिफ्ट की जाने वाली संख्या 13 है, तो परिणाम <a href="rot13">ROT13</a> जैसा ही होगा।</p>

<p>वर्णों को डायक्रिटिकल मार्क्स (diacritical marks) को बनाए रखते हुए शिफ्ट किया जाता है। इसलिए, उदाहरण के लिए "Á" को "X́" में एन्क्रिप्ट किया जाता है।</p>


<h4>अन्य भाषाओं का समर्थन</h4>
<p>लैटिन वर्णों के अलावा, सिरिलिक (Cyrillic) और जापानी हीरागाना/काताकाना का समर्थन किया जाता है।</p>

<h5>सिरिलिक (Cyrillic)</h5>
<p>यदि सिरिलिक वर्णों को -3 वर्ण शिफ्ट किया जाता है, तो वे निम्नानुसार एन्क्रिप्ट होते हैं।</p>

<pre>
एन्क्रिप्शन से पहले : АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ
एन्क्रिप्शन के बाद : ЭЮЯАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬ
</pre>

<p>वर्णों को डायक्रिटिकल मार्क्स को बनाए रखते हुए शिफ्ट किया जाता है। इसलिए, उदाहरण के लिए रूसी "Ё" को "В̈" में एन्क्रिप्ट किया जाता है। "Й" और "й" वर्णों को "И" और "и" के साथ डायक्रिटिकल मार्क " ̆" (Breve) के रूप में नहीं, बल्कि एक अद्वितीय वर्ण के रूप में माना जाता है।</p>

<h5>जापानी हीरागाना/काताकाना</h5>
<p>यदि जापानी हीरागाना/काताकाना को -3 वर्ण शिफ्ट किया जाता है, तो वे निम्नानुसार एन्क्रिप्ट होते हैं।</p>

<pre>
एन्क्रिप्शन से पहले : ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔ
एन्क्रिप्शन के बाद : をんゔぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑ
</pre>

<pre>
एन्क्रिप्शन से पहले : ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴ
एन्क्रिप्शन के बाद : ヲンヴァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱ
</pre>

<p>वर्णों का क्रम Unicode में परिभाषा के क्रम में है। कृपया ध्यान दें कि "ゕ", "ゖ", "ヵ", "ヶ" और "ヷ", "ヸ", "ヹ", "ヺ" एन्क्रिप्शन का विषय नहीं हैं।</p>
