<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>Scytale Cipher के बारे में</h3>
<p>Scytale Cipher एक ट्रांस्पोज़िशन सिफर (transposition cipher) है जो टेक्स्ट में वर्णों को पुनर्व्यवस्थित करके एन्क्रिप्ट करता है। Scytale ग्रीक भाषा में बैटन (baton) का अर्थ है।</p>
<p>एक छड़ी के चारों ओर परचमेंट (parchment) की एक लंबी पट्टी लपेटी जाती है, और पट्टी के पार वर्णों को लिखकर एन्क्रिप्ट किया जाता है।</p>
<p>छड़ी के एक चक्कर में लिखे जा सकने वाले वर्णों की संख्या एन्क्रिप्शन की कुंजी (key) होती है। या, एक पंक्ति में लिखे जा सकने वाले वर्णों की संख्या (परचमेंट को लपेटने की संख्या) भी निर्दिष्ट की जा सकती है।</p>

<p>उदाहरण के लिए, यदि छड़ी के एक चक्कर में 4 वर्ण लिखे जा सकते हैं और हम "THIS_IS_A_SECRET_MESSAGE" को एन्क्रिप्ट करते हैं, तो यह इस प्रकार होगा।</p>

<p>1. परचमेंट के पार वर्णों को रखें। चूंकि छड़ी के एक चक्कर में 4 वर्ण लिखे जा सकते हैं और एन्क्रिप्ट करने के लिए टेक्स्ट 24 वर्णों का है, इसलिए क्षैतिज रूप से 6 वर्णों तक रखा जाता है।</p>
<pre>
-----------------------------------
     | T | H | I | S | _ | I |___|
     | S | _ | A | _ | S | E |
  ___| C | R | E | T | _ | M |
 |   | E | S | S | A | G | E |
-----------------------------------
</pre>

<p>2. छड़ी से परचमेंट को खोलने पर यह एन्क्रिप्ट हो जाता है।</p>
<pre>TSCEH_RSIAESS_TA_S_GIEME</pre>
