<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>Atbash Cipher के बारे में</h3>
<p>Atbash Cipher एक मोनोअल्फाबेटिक सब्सटीट्यूशन सिफर (monoalphabetic substitution cipher) है जो टेक्स्ट में वर्णों को अन्य वर्णों से बदलकर एन्क्रिप्ट करता है।</p>
<p>वर्णों का प्रतिस्थापन वर्णों की सूची को उल्टे क्रम में मैप करके किया जाता है।</p>
<p>उदाहरण के लिए, "ABCDEFGHIJKLMNOPQRSTUVWXYZ" अंग्रेजी वर्णों के मामले में, "A" को "Z" और "B" को "Y" में एन्क्रिप्ट किया जाता है।</p>

<pre>
एन्क्रिप्शन से पहले : ABCDEFGHIJKLMNOPQRSTUVWXYZ
एन्क्रिप्शन के बाद : ZYXWVUTSRQPONMLKJIHGFEDCBA
</pre>

<pre>
एन्क्रिप्शन से पहले का टेक्स्ट : THIS IS A SECRET MESSAGE
एन्क्रिप्शन के बाद का टेक्स्ट : GSRH RH Z HVXIVG NVHHZTV
</pre>

<p>मूल रूप से इसे हिब्रू (Hebrew) सिफर के रूप में उपयोग किया जाता था। हिब्रू एन्क्रिप्शन इस प्रकार है।</p>

<pre>
एन्क्रिप्शन से पहले : אבגדהוזחטיכלמנסעפצקרשת
एन्क्रिप्शन के बाद : תשרקצפעסנמלכיטחזוהדגבא
</pre>

<p>चूंकि इसमें उलटनीयता (reversibility) है कि सिफरटेक्स्ट को फिर से एन्क्रिप्ट करने पर प्लेनटेक्स्ट (plaintext) प्राप्त होता है, इसलिए डिक्रिप्शन भी एन्क्रिप्शन की तरह ही किया जा सकता है।</p>


<h4>अन्य भाषाओं का समर्थन</h4>
<p>लैटिन वर्णों और हिब्रू के अलावा, सिरिलिक (Cyrillic) और जापानी हीरागाना/काताकाना का समर्थन किया जाता है।</p>

<h5>सिरिलिक (Cyrillic)</h5>
<pre>
एन्क्रिप्शन से पहले : АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ
एन्क्रिप्शन के बाद : ЯЮЭЬЫЪЩШЧЦХФУТСРПОНМЛКЙИЗЖЕДГВБА
</pre>

<h5>जापानी हीरागाना/काताकाना</h5>
<pre>
एन्क्रिप्शन से पहले : ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔ
एन्क्रिप्शन के बाद : ゔんをゑゐわゎろれるりらよょゆゅやゃもめむみまぽぼほぺべへぷぶふぴびひぱばはのねぬになどとでてづつっぢちだたぞそぜせずすじしざさごこげけぐくぎきがかおぉえぇうぅいぃあぁ
</pre>

<pre>
एन्क्रिप्शन से पहले : ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴ
एन्क्रिप्शन के बाद : ヴンヲヱヰワヮロレルリラヨョユュヤャモメムミマポボホペベヘプブフピビヒパバハノネヌニナドトデテヅツッヂチダタゾソゼセズスジシザサゴコゲケグクギキガカオォエェウゥイィアァ
</pre>

<p>वर्णों का क्रम Unicode में परिभाषा के क्रम में है। कृपया ध्यान दें कि "ゕ", "ゖ", "ヵ", "ヶ" और "ヷ", "ヸ", "ヹ", "ヺ" एन्क्रिप्शन का विषय नहीं हैं।</p>
