<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>ISO 8601 दिनांक (Date) के बारे में</h3>
<p>ISO 8601, ISO द्वारा अंतर्राष्ट्रीय मानक के रूप में परिभाषित दिनांक और समय प्रारूप है।</p>
<p>दिनांक और समय को "T" से जोड़कर लिखा जाता है। समय क्षेत्र (Timezone) को UTC से अंतर के रूप में "+09:00" की तरह लिखा जाता है, और UTC के मामले में "Z" से दर्शाया जाता है।</p>
<p>सेकंड और मिलीसेकंड के बीच कोमा (,) या डॉट (.) का उपयोग किया जाता है। DenCode में, यदि मिलीसेकंड 000 है, तो मिलीसेकंड को छोड़ दिया जाता है।</p>

<p>ISO 8601 में कई प्रारूप होते हैं।</p>
<p>उदाहरण के लिए, 2000-01-23 01:23:45.678 (JST; +09:00) को ISO 8601 में परिवर्तित करने पर निम्नलिखित परिणाम प्राप्त होता है।</p>

<div class="table-responsive">
	<table class="table">
		<tr><th>प्रारूप</th><th>रूपांतरण परिणाम</th></tr>
		<tr><td>मूल प्रारूप</td><td>20000123T012345.678+0900</td></tr>
		<tr><td>विस्तारित प्रारूप</td><td>2000-01-23T01:23:45.678+09:00</td></tr>
		<tr><td>सप्ताह (वर्ष-सप्ताह-दिन)</td><td>2000-W03-7T01:23:45.678+09:00</td></tr>
		<tr><td>दिन (वर्ष-वर्ष का दिन)</td><td>2000-023T01:23:45.678+09:00</td></tr>
	</table>
</div>
